#1) Кратко опишите что делает каждая команда в GIT
#git init –  инициализирует новый репозиторий Git в текущей папке
#git clone – копирование проекта с внешнего репозитория на свой локальный
#git add – добавить файл или файлы на отслеживание git-ом
#git commit – зафиксировать изменения файла в git
#git push - команда которая передает изменения с локального репозитория в удаленный
#git pull - позволяет забрать изменения с внешнего репозитория и сразу внести изменения на уже существующем локальном репозитрии
#git branch -позволяет создавать, просматривать, переименовывать и удалять ветки
#git checkout - переход с одной ветки на другую
#git merge - слияние веток новый комит
#git rebase - позволяющий объединить изменения двух веток в уже существующий комит
#git cherry-pick - для выборочного применения комита Git к текущей рабочей ветке HEAD
#git status - просмотр в каком статусе находятся наши файлы в текущем репозитории
#git log - просмотр истории ранее созданных комитов
#git reset - перемещает и указатель HEAD , и указатель ветки на заданный коммит
#git revert - операция для безопасной отмены изменений, действие которой направлено в будущее
#git stash - позволяет на время отложить изменения без камита
#git diff - для просмотра разницы между двумя git деревьями
